# Parameters
nc: 80 # number of classes
activation: nn.LeakyReLU(negative_slope=0.125, inplace=True) 
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] 

# YOLOv10n-Slim backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,   [64, 3, 2]]       # 0
  - [-1, 1, nn.MaxPool2d, [2, 2, 0]]  # 1
  - [-1, 1, C2f,    [128, True]]      # 2
  - [-1, 1, Conv,   [256, 3, 2]]      # 3
  - [-1, 1, SCDown, [512, 3, 2]]      # 4-medium
  - [-1, 1, Conv,   [1024, 3, 2]]     # 5
  - [-1, 1, SPPF,   [1024, 2]]        # 6
  - [-1, 1, PSA,    [1024]]           # 7

# YOLOv10n-Slim head
head:
  - [4, 1, nn.Upsample, [None, 2, "nearest"]]       # 8
  - [-1, 1, Conv, [1024, 3, 1]]                     # 9-small

  - [-1, 1, Conv, [512, 3, 2]]                      # 10
  - [-1, 1, nn.MaxPool2d, [2, 2, 0]]                # 11

  - [[7, 11], 1, Concat, [1]]                       # 12
  - [-1, 1, C2fCIB, [1024, True, True]]             # 13-large

  - [[9, 4, 13], 1, v10Detect, [nc]]                # Detect(P3, P4, P5)
